# Question 1 Part 2
- Use ‘vehicle_collisions’ data set
- For each borough, find out distribution of each collision scale. (One carinvolved? Two? Three? or more?) (From 2015 to present)
- Display a few rows of the output use df.head()
- Generate a csv output with five columns ('borough', 'one-vehicle', 'two- vehicles', 'three-vehicles', 'more-vehicles')

In [30]:
import pandas as pd

In [43]:
# drop unnecessary columns
raw_df = pd.read_csv('Data/vehicle_collisions.csv')
col_list = ['BOROUGH', 'VEHICLE 1 TYPE', 'VEHICLE 2 TYPE', 'VEHICLE 3 TYPE', 'VEHICLE 4 TYPE']
raw_df = raw_df[col_list]
raw_df.head(4)

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN

In [44]:
# count how many vehicle types not null for each row
raw_df['COUNT_VEHICLE'] = raw_df.count(axis=1) - 1
raw_df.head(4)

,BOROUGH,VEHICLE 1 TYPE,VEHICLE 2 TYPE,VEHICLE 3 TYPE,VEHICLE 4 TYPE,COUNT_VEHICLE
0,QUEENS,SPORT UTILITY/STATION WAGON,NaN,NaN,NaN,1
1,NaN,PASSENGER VEHICLE,NaN,NaN,NaN,0
2,BROOKLYN,PASSENGER VEHICLE,UNKNOWN,NaN,NaN,2
3,BROOKLYN,BUS,PASSENGER VEHICLE,NaN,NaN,2

In [45]:
# drop unnecessary columns
col_list = ['BOROUGH', 'COUNT_VEHICLE']
raw_df = raw_df[col_list]
raw_df.head(4)

    BOROUGH  COUNT_VEHICLE
0    QUEENS              1
1       NaN              0
2  BROOKLYN              2
3  BROOKLYN              2

In [46]:
# remove zeros for vehicle count
raw_df = raw_df[raw_df['COUNT_VEHICLE'] != 0]
raw_df.head(4)

    BOROUGH  COUNT_VEHICLE
0    QUEENS              1
2  BROOKLYN              2
3  BROOKLYN              2
4       NaN              1

In [47]:
# remove NaN borough
raw_df = raw_df[pd.notnull(raw_df['BOROUGH'])]
raw_df.head(4)

    BOROUGH  COUNT_VEHICLE
0    QUEENS              1
2  BROOKLYN              2
3  BROOKLYN              2
5  BROOKLYN              4

In [48]:
# turn count to str and change numbers which >3 into '3+'
raw_df['COUNT_VEHICLE'] = raw_df['COUNT_VEHICLE'].apply(lambda x : str(x) if x < 4 else '3+')
raw_df.head(4)

    BOROUGH COUNT_VEHICLE
0    QUEENS             1
2  BROOKLYN             2
3  BROOKLYN             2
5  BROOKLYN            3+

In [49]:
# group borough and count then calculate occurence of each count in each borough
df2 = raw_df.groupby(['BOROUGH', 'COUNT_VEHICLE'], as_index=False).size().reset_index()
df2.head(5)

    BOROUGH COUNT_VEHICLE      0
0     BRONX             1   8627
1     BRONX             2  34385
2     BRONX             3   1962
3     BRONX            3+    625
4  BROOKLYN             1  17375

In [50]:
# use borough as index and count as columns to reshape dataframe
df3 = df2.pivot(index='BOROUGH', columns='COUNT_VEHICLE', values=0)
df3

COUNT_VEHICLE      1      2     3    3+
BOROUGH
BRONX           8627  34385  1962   625
BROOKLYN       17375  80207  4980  1612
MANHATTAN      13318  66958  2024   501
QUEENS         12962  70260  4498  1420
STATEN ISLAND   2343  10676   759   165

In [51]:
# change names of columns
df3.columns = ['ONE_VEHICLE_INVOLVED', 'TWO_VEHICLE_INVOLVED', 'THREE_VEHICLE_INVOLVED', 'MORE_VEHICLE_INVOLVED']
df3

,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
BOROUGH,,,,
BRONX,8627,34385,1962,625
BROOKLYN,17375,80207,4980,1612
MANHATTAN,13318,66958,2024,501
QUEENS,12962,70260,4498,1420
STATEN ISLAND,2343,10676,759,165

In [52]:
# reset indices
df4 = df3.reset_index()
df4

,BOROUGH,ONE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,MORE_VEHICLE_INVOLVED
0,BRONX,8627,34385,1962,625
1,BROOKLYN,17375,80207,4980,1612
2,MANHATTAN,13318,66958,2024,501
3,QUEENS,12962,70260,4498,1420
4,STATEN ISLAND,2343,10676,759,165

In [53]:
# save to csv
df4.to_csv('output_csv/q1p2_output.csv',index=False,header=True)